###############################################################################
# Created by write_sdc
###############################################################################
current_design top_i2s_asic
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sd_clk -period 81.0000 [get_ports {sd_clk}]
set_propagated_clock [get_clocks {sd_clk}]
set_output_delay 10.0000 -clock [get_clocks {sd_clk}] -add_delay [get_ports {sd_out}]
set_false_path\
    -from [list [get_ports {i2s_bclk}]\
           [get_ports {i2s_lrck}]\
           [get_ports {i2s_sdata}]\
           [get_ports {rst_n}]]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
